"use strict"

// Zadacha 1

// let num = prompt('Введите число!')
// function getSum(num) {
//     let sum1 = 0;
//     for (let i = 1; i <= num; i++) {
//       sum1 += i;
//     }
//     return sum1;
// }

// console.log(getSum(num));
  
//Zadacha 2.

// function sumPereplaty(sumKredita) {
//     return sumKredita * 0.17 * 5
// }
// alert(`Сумма переплат составит - `+ sumPereplaty(10000));  

// Задача 3.
// Написать функцию trimString , которая в качестве аргумента принимает три
// параметра:
// строку
// значение «от»
// значение «по»
// После вызова функция должна вернуть переданную строку, обрезанную по
// значениям «от» и «по».

function trimString(params) {
    
}

// Задача 4.
// Написать функцию getSumNumbers . Она будет принимать число и вычислять
// сумму цифр, из которых состоит число. Для 2021 это будет 5.


// Задача 5.
// 4. Функции4Написать функцию getSum , которая принимает два целых числа a и b, они могут
// быть положительными или отрицательными, найти сумму всех чисел между
// ними, включая их, и вернуть ее. Если два числа равны, верните a или b.
// getSum(1, 0) == 1 // 1 + 0 = 1
// getSum(1, 2) == 3 // 1 + 2 = 3
// getSum(0, 1) == 1 // 0 + 1 = 1
// getSum(1, 1) == 1 // 1 Since both are same
// getSum(-1, 0) == -1 // -1 + 0 = -1
// getSum(-1, 2) == 2 // -1 + 0 + 1 + 2 = 2
// Задача 6.
// Напишите функцию fooBoo которая принимает в качестве аргумента три
// параметра:
// булевое значение
// функцию foo которая выводит в консоль свое имя
// функцию boo которая выводит в консоль свое имя
// Если переданное булевое значение true , то запускаем функцию foo, иначе boo.
// let num = 0; 
// while (num < 3) {
//     console.log(`Число: ${num}`);
//     num++
// }

// function showName() {
//     console.log('Вася!');
// }
// setTimeout(showName, 0);
// console.log('Коля!')

// showMessage()
// function showMessage() {
//     console.log('Сообщение');
// // }
// if (2 > 1) {
//     function showMessage() {
//         console.log('Сообщение');
//     }
// }
// showMessage();



